ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
        <register>
          <name>HSEM_MISR</name>
          <displayName>HSEM_MISR</displayName>
          <description>HSEM Masked interrupt status
          register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MISF0</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF1</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF2</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF3</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF4</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF5</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF6</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF7</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF8</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF9</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF10</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF11</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF12</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF13</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF14</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF15</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF16</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF17</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF18</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF19</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF20</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF21</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF22</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF23</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF24</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF25</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF26</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF27</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF28</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF29</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF30</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF31</name>
              <description>masked interrupt(N) semaphore n status
              bit after enable (mask).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_ISR</name>
          <displayName>HSEM_ISR</displayName>
          <description>HSEM Interrupt status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISFM0</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM1</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM2</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM3</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM4</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM5</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM6</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM7</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM8</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM9</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM10</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM11</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM12</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM13</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM14</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM15</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM16</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM17</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM18</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM19</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM20</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM21</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM22</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM23</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM24</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM25</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM26</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM27</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM28</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM29</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM30</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISFM31</name>
              <description>Interrupt(N) semaphore n status bit
              before enable (mask).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_CR</name>
          <displayName>HSEM_CR</displayName>
          <description>HSEM Clear register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASTERID</name>
              <description>MasterID of semaphores to be
              cleared</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Semaphore clear Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEM_KEYR</name>
          <displayName>HSEM_KEYR</displayName>
          <description>HSEM Interrupt clear register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>Semaphore Clear Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
