ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
        <register>
          <name>PWR_D3CR</name>
          <displayName>PWR_D3CR</displayName>
          <description>This register allows controlling D3 domain
          power.Following reset VOSRDY will be read 1 by
          software</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit for VCORE voltage scaling
              output selection. This bit is set to 1 by hardware
              when Bypass mode is selected in PWR control register
              3 (PWR_CR3).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling selection according to
              performance These bits control the VCORE voltage
              level and allow to obtains the best trade-off between
              power consumption and performance: When increasing
              the performance, the voltage scaling shall be changed
              before increasing the system frequency. When
              decreasing performance, the system frequency shall
              first be decreased before changing the voltage
              scaling.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_WKUPCR</name>
          <displayName>PWR_WKUPCR</displayName>
          <description>reset only by system reset, not reset by
          wakeup from Standby mode5 wait states are required when
          writing this register (when clearing a WKUPF bit in
          PWR_WKUPFR, the AHB write access will complete after the
          WKUPF has been cleared).</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPC</name>
              <description>Clear Wakeup pin flag for WKUP. These
              bits are always read as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_WKUPFR</name>
          <displayName>PWR_WKUPFR</displayName>
          <description>reset only by system reset, not reset by
          wakeup from Standby mode</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPF1</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF2</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF3</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF4</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF5</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF6</name>
              <description>Wakeup pin WKUPF flag. This bit is set
              by hardware and cleared only by a Reset pin or by
              setting the WKUPCn+1 bit in the PWR wakeup clear
              register (PWR_WKUPCR).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_WKUPEPR</name>
          <displayName>PWR_WKUPEPR</displayName>
          <description>Reset only by system reset, not reset by
          wakeup from Standby mode</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKUPEN1</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN2</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN3</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN4</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN5</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPEN6</name>
              <description>Enable Wakeup Pin WKUPn+1 Each bit is
              set and cleared by software. Note: An additional
              wakeup event is detected if WKUPn+1 pin is enabled
              (by setting the WKUPENn+1 bit) when WKUPn+1 pin level
              is already high when WKUPPn+1 selects rising edge, or
              low when WKUPPn+1 selects falling edge.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP1</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP2</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP3</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP4</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP5</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPP6</name>
              <description>Wakeup pin polarity bit for WKUPn-7
              These bits define the polarity used for event
              detection on WKUPn-7 external wakeup
              pin.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD1</name>
              <description>Wakeup pin pull
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD2</name>
              <description>Wakeup pin pull
              configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD3</name>
              <description>Wakeup pin pull
              configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD4</name>
              <description>Wakeup pin pull
              configuration</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD5</name>
              <description>Wakeup pin pull
              configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WKUPPUPD6</name>
              <description>Wakeup pin pull configuration for
              WKUP(truncate(n/2)-7) These bits define the I/O pad
              pull configuration used when WKUPEN(truncate(n/2)-7)
              = 1. The associated GPIO port pull configuration
              shall be set to the same value or to 00. The Wakeup
              pin pull configuration is kept in Standby
              mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
