ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
        <register>
          <name>MACSTNR</name>
          <displayName>MACSTNR</displayName>
          <description>System time nanoseconds
          register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSS</name>
              <description>TSSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTSUR</name>
          <displayName>MACSTSUR</displayName>
          <description>System time seconds update
          register</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSS</name>
              <description>TSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTNUR</name>
          <displayName>MACSTNUR</displayName>
          <description>System time nanoseconds update
          register</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSS</name>
              <description>TSSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>ADDSUB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSAR</name>
          <displayName>MACTSAR</displayName>
          <description>Timestamp addend register</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAR</name>
              <description>TSAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSSR</name>
          <displayName>MACTSSR</displayName>
          <description>Timestamp status register</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSOVF</name>
              <description>TSSOVF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTARGT0</name>
              <description>TSTARGT0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUXTSTRIG</name>
              <description>AUXTSTRIG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTRGTERR0</name>
              <description>TSTRGTERR0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTSSIS</name>
              <description>TXTSSIS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSSTN</name>
              <description>ATSSTN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ATSSTM</name>
              <description>ATSSTM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSNS</name>
              <description>ATSNS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTxTSSNR</name>
          <displayName>MACTxTSSNR</displayName>
          <description>Tx timestamp status nanoseconds
          register</description>
          <addressOffset>0xB30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXTSSLO</name>
              <description>TXTSSLO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>TXTSSMIS</name>
              <description>TXTSSMIS</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTxTSSSR</name>
          <displayName>MACTxTSSSR</displayName>
          <description>Tx timestamp status seconds
          register</description>
          <addressOffset>0xB34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXTSSHI</name>
              <description>TXTSSHI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACACR</name>
          <displayName>MACACR</displayName>
          <description>Auxiliary control register</description>
          <addressOffset>0xB40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATSFC</name>
              <description>ATSFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN0</name>
              <description>ATSEN0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN1</name>
              <description>ATSEN1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN2</name>
              <description>ATSEN2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN3</name>
              <description>ATSEN3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACATSNR</name>
          <displayName>MACATSNR</displayName>
          <description>Auxiliary timestamp nanoseconds
          register</description>
          <addressOffset>0xB48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXTSLO</name>
              <description>AUXTSLO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACATSSR</name>
          <displayName>MACATSSR</displayName>
          <description>Auxiliary timestamp seconds
          register</description>
          <addressOffset>0xB4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXTSHI</name>
              <description>AUXTSHI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSIACR</name>
          <displayName>MACTSIACR</displayName>
          <description>Timestamp Ingress asymmetric correction
          register</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSTIAC</name>
              <description>OSTIAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSEACR</name>
          <displayName>MACTSEACR</displayName>
          <description>Timestamp Egress asymmetric correction
          register</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSTEAC</name>
              <description>OSTEAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSICNR</name>
          <displayName>MACTSICNR</displayName>
          <description>Timestamp Ingress correction nanosecond
          register</description>
          <addressOffset>0xB58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSIC</name>
              <description>TSIC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSECNR</name>
          <displayName>MACTSECNR</displayName>
          <description>Timestamp Egress correction nanosecond
          register</description>
          <addressOffset>0xB5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEC</name>
              <description>TSEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSCR</name>
          <displayName>MACPPSCR</displayName>
          <description>PPS control register</description>
          <addressOffset>0xB70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPSCTRL</name>
              <description>PPSCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PPSEN0</name>
              <description>PPSEN0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGTMODSEL0</name>
              <description>TRGTMODSEL0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSTTSR</name>
          <displayName>MACPPSTTSR</displayName>
          <description>PPS target time seconds
          register</description>
          <addressOffset>0xB80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSTRH0</name>
              <description>TSTRH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSTTNR</name>
          <displayName>MACPPSTTNR</displayName>
          <description>PPS target time nanoseconds
          register</description>
          <addressOffset>0xB84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TTSL0</name>
              <description>TTSL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>TRGTBUSY0</name>
              <description>TRGTBUSY0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSIR</name>
          <displayName>MACPPSIR</displayName>
          <description>PPS interval register</description>
          <addressOffset>0xB88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPSINT0</name>
              <description>PPSINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPPSWR</name>
          <displayName>MACPPSWR</displayName>
          <description>PPS width register</description>
          <addressOffset>0xB8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPSWIDTH0</name>
              <description>PPSWIDTH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPOCR</name>
          <displayName>MACPOCR</displayName>
          <description>PTP Offload control register</description>
          <addressOffset>0xBC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTOEN</name>
              <description>PTOEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCEN</name>
              <description>ASYNCEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APDREQEN</name>
              <description>APDREQEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCTRIG</name>
              <description>ASYNCTRIG</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APDREQTRIG</name>
              <description>APDREQTRIG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRRDIS</name>
              <description>DRRDIS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DN</name>
              <description>DN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI0R</name>
          <displayName>MACSPI0R</displayName>
          <description>PTP Source Port Identity 0
          Register</description>
          <addressOffset>0xBC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0</name>
              <description>SPI0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI1R</name>
          <displayName>MACSPI1R</displayName>
          <description>PTP Source port identity 1
          register</description>
          <addressOffset>0xBC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI1</name>
              <description>SPI1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSPI2R</name>
          <displayName>MACSPI2R</displayName>
          <description>PTP Source port identity 2
          register</description>
          <addressOffset>0xBCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI2</name>
              <description>SPI2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLMIR</name>
          <displayName>MACLMIR</displayName>
          <description>Log message interval register</description>
          <addressOffset>0xBD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSI</name>
              <description>LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DRSYNCR</name>
              <description>DRSYNCR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LMPDRI</name>
              <description>LMPDRI</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
