ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
        <register>
          <name>OTG_HS_HCINTMSK15</name>
          <displayName>OTG_HS_HCINTMSK15</displayName>
          <description>OTG_HS host channel-15 interrupt mask
          register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFRCM</name>
              <description>Transfer completed mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHHM</name>
              <description>Channel halted mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL response received interrupt
              mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKM</name>
              <description>NAK response received interrupt
              mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKM</name>
              <description>ACK response received/transmitted
              interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYET</name>
              <description>Response received
              interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERRM</name>
              <description>Transaction error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BBERRM</name>
              <description>Babble error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMORM</name>
              <description>Frame overrun mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRM</name>
              <description>Data toggle error mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCTSIZ15</name>
          <displayName>OTG_HS_HCTSIZ15</displayName>
          <description>OTG_HS host channel-15 transfer size
          register</description>
          <alternateRegister>OTG_HS_HCTSIZSG15</alternateRegister>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMA15</name>
          <displayName>OTG_HS_HCDMA15</displayName>
          <description>OTG_HS host channel-15 DMA address
          register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCTSIZSG0</name>
          <displayName>OTG_HS_HCTSIZSG0</displayName>
          <description>OTG host channel x transfer size
          register</description>
          <alternateRegister>OTG_HS_HCTSIZ0</alternateRegister>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCHED_INFO</name>
              <description>Schedule information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NTD</name>
              <description>Number of transfer
              descriptors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PID</name>
              <description>PID</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DOPNG</name>
              <description>Do ping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCTSIZSG1</name>
          <displayName>OTG_HS_HCTSIZSG1</displayName>
          <description>OTG host channel x transfer size
          register</description>
          <alternateRegister>OTG_HS_HCTSIZ1</alternateRegister>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCHED_INFO</name>
              <description>Schedule information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NTD</name>
              <description>Number of transfer
              descriptors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PID</name>
              <description>PID</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DOPNG</name>
              <description>Do ping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG0</name>
          <displayName>OTG_HS_HCDMASG0</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA0</alternateRegister>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG1</name>
          <displayName>OTG_HS_HCDMASG1</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA1</alternateRegister>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG2</name>
          <displayName>OTG_HS_HCDMASG2</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA2</alternateRegister>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG3</name>
          <displayName>OTG_HS_HCDMASG3</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA3</alternateRegister>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG4</name>
          <displayName>OTG_HS_HCDMASG4</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA4</alternateRegister>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG5</name>
          <displayName>OTG_HS_HCDMASG5</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA5</alternateRegister>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG6</name>
          <displayName>OTG_HS_HCDMASG6</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA6</alternateRegister>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG7</name>
          <displayName>OTG_HS_HCDMASG7</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA7</alternateRegister>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG8</name>
          <displayName>OTG_HS_HCDMASG8</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA8</alternateRegister>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG9</name>
          <displayName>OTG_HS_HCDMASG9</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA9</alternateRegister>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG10</name>
          <displayName>OTG_HS_HCDMASG10</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA10</alternateRegister>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG11</name>
          <displayName>OTG_HS_HCDMASG11</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA11</alternateRegister>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG12</name>
          <displayName>OTG_HS_HCDMASG12</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA12</alternateRegister>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG13</name>
          <displayName>OTG_HS_HCDMASG13</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA13</alternateRegister>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG14</name>
          <displayName>OTG_HS_HCDMASG14</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA14</alternateRegister>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_HS_HCDMASG15</name>
          <displayName>OTG_HS_HCDMASG15</displayName>
          <description>OTG host channel x DMA address in
          scatter/gather DMA register</description>
          <alternateRegister>OTG_HS_HCDMA15</alternateRegister>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMASG</name>
              <description>DMA scatter/gather
              information</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
