ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="OTG_HS_DEVICE">
      <name>OTG_FS_DEVICE</name>
      <baseAddress>0x40080800</baseAddress>
      <interrupt>
        <name>OTG_HS_WKUP</name>
        <description>OTG_HS wakeup interrupt</description>
        <value>76</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RAMECC2</name>
      <description>ECC controller is associated to each RAM
      area</description>
      <groupName>RAMECC</groupName>
      <baseAddress>0x48023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>OTG_FS_WKUP</name>
        <description>OTG_FS wakeup</description>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>RAMECC interrupt enable
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIE</name>
              <description>Global interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCSEIE_</name>
              <description>Global ECC single error interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCDEIE</name>
              <description>Global ECC double error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCDEBWIE</name>
              <description>Global ECC double error on byte write
              (BW) interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1CR</name>
          <displayName>M1CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2CR</name>
          <displayName>M2CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3CR</name>
          <displayName>M3CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4CR</name>
          <displayName>M4CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5CR</name>
          <displayName>M5CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1SR</name>
          <displayName>M1SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2SR</name>
          <displayName>M2SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3SR</name>
          <displayName>M3SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4SR</name>
          <displayName>M4SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5SR</name>
          <displayName>M5SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FAR</name>
          <displayName>M1FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FAR</name>
          <displayName>M2FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3FAR</name>
          <displayName>M3FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4FAR</name>
          <displayName>M4FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5FAR</name>
          <displayName>M5FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FDRL</name>
          <displayName>M1FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FDRL</name>
          <displayName>M2FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3FDRL</name>
          <displayName>M3FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4FDRL</name>
          <displayName>M4FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5FDRL</name>
          <displayName>M5FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FDRH</name>
          <displayName>M1FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FDRH</name>
          <displayName>M2FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M3FDRH</name>
          <displayName>M3FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M4FDRH</name>
          <displayName>M4FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M5FDRH</name>
          <displayName>M5FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
