ynkyght/Lvgl_test/.pack/Keil/STM32H7xx_DFP.2.3.1/CMSIS/SVD/STM32H7x7_CM4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RAMECC3</name>
      <description>ECC controller is associated to each RAM
      area</description>
      <groupName>RAMECC</groupName>
      <baseAddress>0x58027000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>RAMECC interrupt enable
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIE</name>
              <description>Global interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCSEIE_</name>
              <description>Global ECC single error interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCDEIE</name>
              <description>Global ECC double error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GECCDEBWIE</name>
              <description>Global ECC double error on byte write
              (BW) interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1CR</name>
          <displayName>M1CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2CR</name>
          <displayName>M2CR</displayName>
          <description>RAMECC monitor x configuration
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECCSEIE</name>
              <description>ECC single error interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEIE</name>
              <description>ECC double error interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDEBWIE</name>
              <description>ECC double error on byte write (BW)
              interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELEN</name>
              <description>ECC error latching enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1SR</name>
          <displayName>M1SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2SR</name>
          <displayName>M2SR</displayName>
          <description>RAMECC monitor x status
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEDCF</name>
              <description>ECC single error detected and corrected
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEDF</name>
              <description>ECC double error detected
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEBWDF</name>
              <description>ECC double error on byte write (BW)
              detected flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FAR</name>
          <displayName>M1FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FAR</name>
          <displayName>M2FAR</displayName>
          <description>RAMECC monitor x failing address
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADD</name>
              <description>ECC error failing address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FDRL</name>
          <displayName>M1FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FDRL</name>
          <displayName>M2FDRL</displayName>
          <description>RAMECC monitor x failing data low
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAL</name>
              <description>Failing data low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FDRH</name>
          <displayName>M1FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FDRH</name>
          <displayName>M2FDRH</displayName>
          <description>RAMECC monitor x failing data high
          register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATAH</name>
              <description>Failing data high (64-bit
              memory)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M1FECR</name>
          <displayName>M1FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M2FECR</name>
          <displayName>M2FECR</displayName>
          <description>RAMECC monitor x failing ECC error code
          register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEC</name>
              <description>Failing error code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
